Config/Documents/ОбесценениеБА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОбесценениеБА</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерПервичногоДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПСРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КЭКРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоРасходов1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоРасходов2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоРасходов3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПСДоходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КЭКДоходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеДоходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоДоходов1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоДоходов2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоДоходов3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительнаяАналитикаСчета</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОбесценения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОбесцененияДоИзменения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Documents/ОбесценениеБА/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаУдаленияПроведения(Отказ)
	ПроведениеСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	УправлениеМатериальнымиЗапасами.ПроверитьОчиститьКолонкуКПС(Материалы);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	ПроверитьНеобходимостьЗаполненияРеквизитовСчетовРасходовДоходов(НепроверяемыеРеквизиты);
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
	УправлениеМатериальнымиЗапасами.ПроверитьЗаполнениеКолонкиКПСВТаблицеМатериалов(ЭтотОбъект, "Материалы", "Материалы", Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьНеобходимостьЗаполненияРеквизитовСчетовРасходовДоходов(НепроверяемыеРеквизиты)

	ПроверятьСчетДоходов = Ложь;
	ПроверятьСчетРасходов = Ложь;
	
	Для Каждого Строка Из Материалы Цикл
		ПроверятьСчетДоходов = ПроверятьСчетДоходов Или Строка.СуммаОбесцененияДоИзменения < Строка.СуммаОбесценения;
		ПроверятьСчетРасходов = ПроверятьСчетРасходов Или Строка.СуммаОбесценения < Строка.СуммаОбесцененияДоИзменения;
		Если ПроверятьСчетДоходов И ПроверятьСчетРасходов Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	РеквизитыДоходов = Новый Структура;
	РеквизитыДоходов.Вставить("СчетДоходов", Ложь);
	РеквизитыДоходов.Вставить("КПСДоходов", Ложь);
	РеквизитыДоходов.Вставить("КЭКДоходов", Ложь);
	РеквизитыДоходов.Вставить("ПодразделениеДоходов", Ложь);
	РеквизитыДоходов.Вставить("СубконтоДоходов1", Ложь);
	РеквизитыДоходов.Вставить("СубконтоДоходов2", Ложь);
	РеквизитыДоходов.Вставить("СубконтоДоходов3", Ложь);
	
	Если ПроверятьСчетДоходов Тогда
		РеквизитыДоходов.СчетДоходов = Истина;
		Если ЗначениеЗаполнено(СчетДоходов) Тогда
			СвойстваСчета = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СчетДоходов);
			Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям")
					И СвойстваСчета.УчетПоПодразделениям
					И Не СвойстваСчета.РазрешитьНеУказыватьПодразделение Тогда
				РеквизитыДоходов.ПодразделениеДоходов = Истина;
			КонецЕсли;
			Если СвойстваСчета.КоличествоСубконто > 0 Тогда
				РеквизитыДоходов.СубконтоДоходов1 = Истина;
			КонецЕсли;
			Если СвойстваСчета.КоличествоСубконто > 1 Тогда
				РеквизитыДоходов.СубконтоДоходов2 = Истина;
			КонецЕсли;
			Если СвойстваСчета.КоличествоСубконто > 2 Тогда
				РеквизитыДоходов.СубконтоДоходов3 = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого КлючЗначение Из РеквизитыДоходов Цикл
		Если Не КлючЗначение.Значение Тогда
			НепроверяемыеРеквизиты.Добавить(КлючЗначение.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	РеквизитыРасходов = Новый Структура;
	РеквизитыРасходов.Вставить("СчетРасходов", Ложь);
	РеквизитыРасходов.Вставить("КПСРасходов", Ложь);
	РеквизитыРасходов.Вставить("КЭКРасходов", Ложь);
	РеквизитыРасходов.Вставить("ПодразделениеРасходов", Ложь);
	РеквизитыРасходов.Вставить("СубконтоРасходов1", Ложь);
	РеквизитыРасходов.Вставить("СубконтоРасходов2", Ложь);
	РеквизитыРасходов.Вставить("СубконтоРасходов3", Ложь);
	
	Если ПроверятьСчетРасходов Тогда
		РеквизитыРасходов.СчетРасходов = Истина;
		Если ЗначениеЗаполнено(СчетРасходов) Тогда
			СвойстваСчета = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СчетРасходов);
			Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям")
					И СвойстваСчета.УчетПоПодразделениям
					И Не СвойстваСчета.РазрешитьНеУказыватьПодразделение Тогда
				РеквизитыРасходов.ПодразделениеРасходов = Истина;
			КонецЕсли;
			Если СвойстваСчета.КоличествоСубконто > 0 Тогда
				РеквизитыРасходов.СубконтоРасходов1 = Истина;
			КонецЕсли;
			Если СвойстваСчета.КоличествоСубконто > 1 Тогда
				РеквизитыРасходов.СубконтоРасходов2 = Истина;
			КонецЕсли;
			Если СвойстваСчета.КоличествоСубконто > 2 Тогда
				РеквизитыРасходов.СубконтоРасходов3 = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого КлючЗначение Из РеквизитыРасходов Цикл
		Если Не КлючЗначение.Значение Тогда
			НепроверяемыеРеквизиты.Добавить(КлючЗначение.Ключ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти	
	
#КонецЕсли
